src/cf/Catalogs/пэмМетрики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>пэмМетрики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМетрики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пэмТипыМетрик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПолученияМетрики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пэмМетодыПолученияМетрик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/пэмМетодыПолученияМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>пэмМетодыПолученияМетрик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Pull</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Push</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/пэмМетрики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// пэмМетрики
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Алгоритм ="
		|//Пример:		
		|//ТаблицаЗначений = Новый ТаблицаЗначений;
		|//ТаблицаЗначений.Колонки.Добавить(""label"", Новый ОписаниеТипов(""Строка""));
		|//ТаблицаЗначений.Колонки.Добавить(""value"", Новый ОписаниеТипов(""Число""));
		|//
		|//ГСЧ = Новый ГенераторСлучайныхЧисел();
		|//
		|//НоваяСтрока = ТаблицаЗначений.добавить();
		|//НоваяСтрока.label = ""Показатель_1"";
		|//НоваяСтрока.value = 	ГСЧ.СлучайноеЧисло(0,100);
		|//
		|//НоваяСтрока = ТаблицаЗначений.добавить();
		|//НоваяСтрока.label = ""Показатель_2"";
		|//НоваяСтрока.value = ГСЧ.СлучайноеЧисло(0,50);";
		
	КонецЕсли;
	конс_ПодключаемаяКонсольКлиент.ПодключитьРедактор(ЭтаФорма);
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	конс_ПодключаемаяКонсольСервер.ИнициализироватьРедактор(ЭтотОбъект, УникальныйИдентификатор, "РедакторКода");
	ПараметрыРегламентногоЗадания = пэмМетрикиСервер.ПолучитьПараметрыРегламентногоЗадания(Объект.ИдентификаторРегламента);
	
	// Проверка версии для предопределённых метрик
	ПроверитьДоступностьОбновленияМетрики();
	 	 					
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Алгоритм = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если ПараметрыРегламентногоЗадания.Предопределенное Тогда
		ПараметрыРегламентногоЗадания.Наименование = Метаданные.РегламентныеЗадания.пэмВыполнитьРасчетМетрик.Наименование;
		ПараметрыРегламентногоЗадания.Ключ = Метаданные.РегламентныеЗадания.пэмВыполнитьРасчетМетрик.Ключ;
		ПараметрыРегламентногоЗадания.Параметры = Неопределено;
	Иначе
		НаименованиеРегламента = Метаданные.РегламентныеЗадания.пэмВыполнитьРасчетМетрик.Наименование;
		НаименованиеРегламента = СтрЗаменить(НаименованиеРегламента,"(Общий регламент)","(Метрика: " + ТекущийОбъект.Код + ")");
		ПараметрыРегламентногоЗадания.Наименование = НаименованиеРегламента;
		
		КлючРегламента = Метаданные.РегламентныеЗадания.пэмВыполнитьРасчетМетрик.Ключ + " " + ТекущийОбъект.Код;
		ПараметрыРегламентногоЗадания.Ключ = КлючРегламента;
		
		ПараметрыРегламента = Новый Массив;
		ПараметрыРегламента.Добавить(ТекущийОбъект.Код);
		ПараметрыРегламентногоЗадания.Параметры = ПараметрыРегламента;
		
		ПараметрыРегламентногоЗадания.Использование = ТекущийОбъект.Активность;
	КонецЕсли;
		      		
	пэмМетрикиСервер.ОбновитьРегламентноеЗадание(ПараметрыРегламентногоЗадания);
	ТекущийОбъект.ИдентификаторРегламента = ПараметрыРегламентногоЗадания.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МаскаИмениМетрики = "[a-zA-Z_:][a-zA-Z0-9_:]*";
	
	Результат = пэмМетрикиСервер.ПроверитьСтрокуНаСоответствиеМаске(Объект.Код,МаскаИмениМетрики);
	Если Результат.ЕстьОшибка Тогда
		Отказ = Истина;
		Сообщить("Имя метрики не соответствует маске: " + МаскаИмениМетрики);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура АктивностьПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональноеРасписаниеПриИзменении(Элемент)
	
	ПараметрыРегламентногоЗадания.Предопределенное = НЕ ПерсональноеРасписание;
	Если ПерсональноеРасписание Тогда
		ПараметрыРегламентногоЗадания.Использование = Истина;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура МетодПолученияМетрикиПриИзменении(Элемент)

	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеМетодаДоставкиМетрикиНажатие(Элемент)
	
	Если ПараметрыРегламентногоЗадания.Предопределенное Тогда
		ОткрытьФорму("ОбщаяФорма.пэмНастройкиМетрик");
	Иначе
		пэмМетрикиКлиент.ОбработатьИзменениеРасписания(ПараметрыРегламентногоЗадания, ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьПроверкуАлгоритма(Команда)
	Объект.Алгоритм = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);
	ВыполнитьПроверкуАлгоритмаРасчетаНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьМетрикуИзМакета(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьМетрикуИзМакетаЗавершение", ЭтотОбъект);
	ТекстВопроса = "Обновить алгоритм и настройки метрики из макета?
	|Текущий алгоритм будет перезаписан.";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМетрикуИзМакетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбновитьМетрикуИзМакетаНаСервере() Тогда
		ПоказатьОповещениеПользователя("Метрика обновлена", , "Алгоритм и настройки загружены из макета");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбновитьСостояниеФормы() Экспорт

	ПерсональноеРасписание = НЕ ПараметрыРегламентногоЗадания.Предопределенное;
	ЭтоМетрикаОпроса = Объект.МетодПолученияМетрики
		= ПредопределенноеЗначение("Перечисление.пэмМетодыПолученияМетрик.Pull");

	Если ЭтоМетрикаОпроса Тогда
		КартинкаСостояниеМетодаДоставки = ?(Объект.Активность,
			БиблиотекаКартинок.пэмPullGreen, БиблиотекаКартинок.пэмPullRed);
	Иначе
		ОтправкаВыполняется = Объект.Активность И ПараметрыРегламентногоЗадания.Использование
			И пэмМетрикиВызовСервера.РазрешеноИспользованиеМетодаPush();
		КартинкаСостояниеМетодаДоставки = ?(ОтправкаВыполняется,
			БиблиотекаКартинок.пэмPushGreen, БиблиотекаКартинок.пэмPushRed);
	КонецЕсли;

	Если ЭтоМетрикаОпроса И НЕ ПерсональноеРасписание Тогда
		ПредставлениеРасписания = НСтр("ru = 'Расписание расчёта определяется настройками Prometheus'");
	Иначе
		ПредставлениеРасписания = пэмМетрикиКлиент.ПолучитьПредставлениеРасписания(ПараметрыРегламентногоЗадания);
	КонецЕсли;

	Элементы.ОписаниеМетодаДоставкиМетрики.Заголовок = ПредставлениеРасписания;
	Элементы.ГдеДоступноЗначениеМетрики.Заголовок = ОписаниеДоступностиЗначения(ЭтоМетрикаОпроса,
		ПерсональноеРасписание);
	Элементы.СостояниеМетодаДоставки.Картинка = КартинкаСостояниеМетодаДоставки;

КонецПроцедуры

// Возвращает описание того, где потребитель получит значение метрики при выбранном сочетании
// метода получения и расписания расчёта. Персональное расписание меняет момент расчёта,
// а не адрес доставки, и без пояснения это сочетание читается как потеря метрики.
//
// Параметры:
//   ЭтоМетрикаОпроса - Булево - Истина для метода получения Pull
//   ПерсональноеРасписание - Булево - метрике назначено персональное регламентное задание
//
// Возвращаемое значение:
//   Строка - описание для показа администратору
//
&НаКлиенте
Функция ОписаниеДоступностиЗначения(ЭтоМетрикаОпроса, ПерсональноеРасписание)

	Если ЭтоМетрикаОпроса И ПерсональноеРасписание Тогда
		Возврат НСтр("ru = 'Значение рассчитывается по персональному расписанию и выдаётся
			|в ответе на опрос Prometheus значением последнего расчёта'");
	ИначеЕсли ЭтоМетрикаОпроса Тогда
		Возврат НСтр("ru = 'Значение рассчитывается в момент опроса и выдаётся в ответе на опрос Prometheus'");
	ИначеЕсли ПерсональноеРасписание Тогда
		Возврат НСтр("ru = 'Значение рассчитывается по персональному расписанию и отправляется на Pushgateway'");
	КонецЕсли;

	Возврат НСтр("ru = 'Значение рассчитывается общим регламентным заданием и отправляется на Pushgateway'");

КонецФункции

&НаСервере
Процедура ВыполнитьПроверкуАлгоритмаРасчетаНаСервере()
	
	сткВозврат = пэмМетрикиСервер.СформироватьМетрику(Объект.Алгоритм);
	Если сткВозврат.Ошибка Тогда
		
		Сообщить("Процесс проверки расчета завершен с ошибкой на этапе расчета.
		|Описание ошибки:" +
		Символы.ПС + сткВозврат.ОписаниеОшибки);
		
		Возврат;
		
	КонецЕсли;
	           		
	сткВозврат = пэмМетрикиСервер.ПривестиТаблицуРасчетаМетрикиКСтрокеPrometheus(Объект.Код, Объект.ТипМетрики,
		сткВозврат.МетрикаТаблицей, Объект.Наименование);
	
	Если сткВозврат.Ошибка Тогда
		
		Сообщить("Процесс проверки расчета завершен с ошибкой на этапе преобразования.
		||Итоговая метрика:" +
		Символы.ПС + сткВозврат.МетрикаСтрокой + "
		|Описание ошибки:" +
		Символы.ПС + сткВозврат.ОписаниеОшибки);
		
		Возврат;

	КонецЕсли;
	
	Сообщить("Проверка алгоритма расчета завершена.
			 |Итоговая метрика:" +
			 Символы.ПС + сткВозврат.МетрикаСтрокой);

КонецПроцедуры



&НаСервере
Процедура ПроверитьДоступностьОбновленияМетрики()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем только предопределённые элементы
	Если НЕ Объект.Ссылка.Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеИзМакета = пэмМетрикиСервер.ПолучитьОписаниеМетрикиИзМакета(Объект.Код);
	Если ОписаниеИзМакета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВерсияВМакете = ОписаниеИзМакета.версия;
	ТекущаяВерсия = Объект.Версия;
	
	Если ВерсияВМакете > ТекущаяВерсия Тогда
		ДоступноОбновлениеМетрики = Истина;
		ВерсияВМакетеДляОбновления = ВерсияВМакете;
		Элементы.ГруппаОбновлениеДоступно.Видимость = Истина;
		Элементы.НадписьОбновлениеДоступно.Заголовок = СтрШаблон(
			"Доступна новая версия алгоритма метрики (v%1 → v%2)", 
			Формат(ТекущаяВерсия, "ЧГ="), 
			Формат(ВерсияВМакете, "ЧГ="));
	Иначе
		ДоступноОбновлениеМетрики = Ложь;
		ВерсияВМакетеДляОбновления = 0;
		Элементы.ГруппаОбновлениеДоступно.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьМетрикуИзМакетаНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеИзМакета = пэмМетрикиСервер.ПолучитьОписаниеМетрикиИзМакета(Объект.Код);
	Если ОписаниеИзМакета = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Загружаем алгоритм из макета
	Алгоритм = пэмМетрикиСервер.ПолучитьАлгоритмМетрикиИзМакета(ОписаниеИзМакета.макет);
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипМетрики = пэмМетрикиСервер.ПолучитьТипМетрикиПоИмени(ОписаниеИзМакета.типМетрики);
	МетодПолученияМетрики = пэмМетрикиСервер.ПолучитьМетодПолученияПоИмени(ОписаниеИзМакета.методПолучения);
	Если ТипМетрики = Неопределено ИЛИ МетодПолученияМетрики = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Индекс метрик содержит недопустимый тип метрики или метод получения.
			|Метрика не обновлена.";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	// Обновляем данные объекта
	Объект.Наименование = ОписаниеИзМакета.наименование;
	Объект.ТипМетрики = ТипМетрики;
	Объект.МетодПолученияМетрики = МетодПолученияМетрики;
	Объект.Активность = ОписаниеИзМакета.активность;
	Объект.Алгоритм = Алгоритм;
	Объект.Версия = ОписаниеИзМакета.версия;
	
	// Скрываем панель обновления
	ДоступноОбновлениеМетрики = Ложь;
	Элементы.ГруппаОбновлениеДоступно.Видимость = Ложь;
	
	Модифицированность = Истина;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура РедакторКодаДокументСформирован(Элемент)
	конс_ПодключаемаяКонсольКлиент.ОбработчикДокументСформирован(ЭтаФорма);
	ДобавитьПеременные();
	конс_ПодключаемаяКонсольКлиент.ЗагрузитьПользовательскийКонтекст(ЭтаФорма);
	конс_ПодключаемаяКонсольКлиент.УстановитьТекст(ЭтаФорма, Объект.Алгоритм);
    
КонецПроцедуры

&НаСервере
Процедура ДобавитьПеременные()
	конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "ТаблицаЗначений", Тип("ТаблицаЗначений"),
		"Результат алгоритма. Обязательная колонка value (Число), дополнительные колонки — разделители метрик (Строка)");
КонецПроцедуры

&НаКлиенте
Процедура РедакторКодаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	конс_ПодключаемаяКонсольКлиент.ОбработчикПриНажатии(ЭтаФорма, ДанныеСобытия);
КонецПроцедуры

#КонецОбласти
